base/DataProcessors/бит_ИмпортЭкспортШаблоновДвижений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_ИмпортЭкспортШаблоновДвижений</Name>
			<Comment>МХО</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФайлИмпорта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлЭкспорта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

base/InformationRegisters/бит_ЗначенияРеквизитовШаблонов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_ЗначенияРеквизитовШаблонов</Name>
			<Comment>//Хранит значения реквизитов для различных шаблонов</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>999</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЭтоСписок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ШаблонДвижений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ШаблоныДвижений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Реквизит</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ВидыРеквизитовДвижений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерДвижения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЗначения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

base/Enums/бит_ВидыОбъектовСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыОбъектовСистемы</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Справочник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Документ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланСчетов</Name>
					<Comment>План счетов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланВидовХарактеристик</Name>
					<Comment>План видов характеристик</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрСведений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрНакопления</Name>
					<Comment>Регистр накопления</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрБухгалтерии</Name>
					<Comment>Регистр бухгалтерии</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Задача</Name>
					<Comment>Задача</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БизнесПроцесс</Name>
					<Comment>Бизнес процесс</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Catalogs/бит_ОбъектыСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_ОбъектыСистемы</Name>
			<Comment>(БИТ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОбъектовСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбъектаПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗначенияОбъекта</Name>
					<Comment>(БИТ)</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отключено</Name>
					<Comment>Отключено действие механизма разделения доступа на уровне базы</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокЭлемента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокФормыВыбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

base/Catalogs/бит_КомплектыДвижений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_КомплектыДвижений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеВерсииХО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусВерсии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СтатусыКомплектовДвижений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>//Пользователь, создавший документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>//Пользователь, утвердивший комплект</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУтверждения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередФормированиемПроводокВерсии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеФормированияПроводокВерсии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОбработчикаПроведения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтекПеременных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоРучныеИзменения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УникальныйИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ШаблоныДвижений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ШаблонДвижения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ШаблоныДвижений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Переменные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>999</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

base/DataProcessors/бит_ИмпортЭкспортШаблоновДвижений/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает текст XML выгрузки шаблонов.
// 
Функция СформироватьXMLОписаниеВыгрузки(СписокКомплектов, СписокШаблонов) Экспорт
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
	
	ТД = Новый ТекстовыйДокумент;
	ТД.Записать(ИмяВременногоФайла);
	
	// Сформируем заголовок файла обмена.
	ЗаписьXML = НачатьЗаписьФайлаЭкспорта(ИмяВременногоФайла);
	// Начало записи данных.
	ЗаписьXML.ЗаписатьНачалоЭлемента("V8Exch:Data");
	// Запишем все виды реквизитов движений.
	ЗаписатьВидыРеквизитовДвижений(ЗаписьXML, СписокШаблонов);
	// Запишем необходимые объекты доступа (документы).
	ВидыОбъектовДоступа = Новый Массив;
	ВидыОбъектовДоступа.Добавить(Перечисления.бит_ВидыОбъектовСистемы.Документ);
	ЗаписатьОбъектыДоступа(ЗаписьXML, ВидыОбъектовДоступа);
	
	// Выгрузим выбранные комплекты.
	Для Каждого Комплект Из СписокКомплектов Цикл
		Если ЗначениеЗаполнено(Комплект) Тогда
			ЗаписатьXML(ЗаписьXML, Комплект.ПолучитьОбъект());
		КонецЕсли;
	КонецЦикла;
	
	// Выгрузим выбранные шаблоны.
	Для Каждого Шаблон Из СписокШаблонов Цикл
		Если ЗначениеЗаполнено(Шаблон) Тогда
			ЗаписатьXML(ЗаписьXML, Шаблон.ПолучитьОбъект());
		КонецЕсли;
	КонецЦикла;
	
	// Выгрузим значения реквизитов движений.
	НаборЗаписей = РегистрыСведений.бит_ЗначенияРеквизитовШаблонов.СоздатьНаборЗаписей();
	Для Каждого Шаблон Из СписокШаблонов Цикл
		Если ЗначениеЗаполнено(Шаблон) Тогда
			НаборЗаписей.Отбор.ШаблонДвижений.Установить(Шаблон);
			НаборЗаписей.Прочитать();
			ЗаписатьXML(ЗаписьXML, НаборЗаписей);
		КонецЕсли;
	КонецЦикла;
	
	// Закончим запись файла обмена.
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.Закрыть();
	
	ТД.Прочитать(ИмяВременногоФайла);
	
	ТекстXML = ТД.ПолучитьТекст();
		
	УдалитьФайлы(ИмяВременногоФайла);
	
	Возврат ТекстXML;
	
КонецФункции

// Процедура записывает виды реквизитов в файл выгрузки.
// 
Процедура ЗаписатьВидыРеквизитовДвижений(ЗаписьXML, СписокШаблонов) Экспорт
	
	// Выберем необходимые реквизиты движений.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокШаблонов", СписокШаблонов);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_ЗначенияРеквизитовШаблонов.Реквизит
	|ИЗ
	|	РегистрСведений.бит_ЗначенияРеквизитовШаблонов КАК бит_ЗначенияРеквизитовШаблонов
	|ГДЕ
	|	бит_ЗначенияРеквизитовШаблонов.ШаблонДвижений В(&СписокШаблонов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бит_ВидыРеквизитовДвижений.Ссылка
	|ИЗ
	|	Справочник.бит_ВидыРеквизитовДвижений КАК бит_ВидыРеквизитовДвижений
	|ГДЕ
	|	бит_ВидыРеквизитовДвижений.ЭтоГруппа = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ВидыРеквизитовДвижений.Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Поочередная запись.
	Пока Выборка.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(Выборка.Реквизит) Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаписатьXML(ЗаписьXML, Выборка.Реквизит.ПолучитьОбъект());
	КонецЦикла;
	
КонецПроцедуры

// Процедура загружает шаблоны из файла выгрузки.
// 
Процедура ЗагрузитьШаблоны(ФайлВыгрузки, ТекстовыйДокумент = Неопределено) Экспорт
	                                  
	// Необходимо привести файл выгрузки к виду, пригодному для загрузки,
	// т.е. заменить уникальные идентификаторы исходного xml-файла
	// соответствующими существующими идентификаторами, т.к. возможны
	// ситуации переноса шаблонов между не синхронизированными по объектам
	// между собой базами.
	ТекстСообщения = НСтр("ru='Обработка файла перед загрузкой...';en='Processing file before uploading ...'");		 
	СообщитьВПоле(ТекстовыйДокумент, ТекстСообщения);
	НовоеИмяФайла = ИсправитьФайлИмпорта(ФайлВыгрузки);
	СообщитьВПоле(ТекстовыйДокумент, НСтр("ru='Успешно';en='Successfully'"));
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(НовоеИмяФайла);
	
	ТекстСообщения = НСтр("ru='Начало чтения файла ""%1"" %2...';en='Start reading file ""%1"" %2 ...'");
	ТекстСообщения = СтрШаблон(ТекстСообщения, НовоеИмяФайла, Строка(ТекущаяДатаСеанса()));
	СообщитьВПоле(ТекстовыйДокумент, ТекстСообщения);
	ТекстСообщения = НСтр("ru='-- Проверка заголовка файла';en='-- Check file header'");
	СообщитьВПоле(ТекстовыйДокумент, ТекстСообщения);
	
	Если Не ЧтениеXML.Прочитать() ИЛИ ЧтениеXML.ТипУзла <> ТипУзлаXML.НачалоЭлемента 
		ИЛИ ЧтениеXML.ЛокальноеИмя <> "_1CV8DtUD" ИЛИ ЧтениеXML.URIПространстваИмен <> "http://www.1c.ru/V8/1CV8DtUD/" Тогда 
		Возврат;
	КонецЕсли;
	Если Не ЧтениеXML.Прочитать() ИЛИ ЧтениеXML.ТипУзла <> ТипУзлаXML.НачалоЭлемента 
		ИЛИ ЧтениеXML.ЛокальноеИмя <> "Data" ИЛИ ЧтениеXML.URIПространстваИмен <> "http://www.1c.ru/V8/1CV8DtUD/" Тогда 
		Возврат;
	КонецЕсли;
	
	Если Не ЧтениеXML.Прочитать() Тогда 
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = НСтр("ru='-- успешно';en='-- successfully'");
	СообщитьВПоле(ТекстовыйДокумент, ТекстСообщения);
	
	Пока ВозможностьЧтенияXML(ЧтениеXML) Цикл
		
		Попытка
			НовЭлем = ПрочитатьXML(ЧтениеXML);
			ТекстСообщения = НСтр("ru='Загружен элемент: %1';en='Item loaded: %1'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, Строка(НовЭлем));
			СообщитьВПоле(ТекстовыйДокумент, ТекстСообщения);
		Исключение
			ТекстСообщения = НСтр("ru='Ошибка: %1';en='Error: %1'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			СообщитьВПоле(ТекстовыйДокумент, ТекстСообщения);
		КонецПопытки;
		
		НовЭлем.ОбменДанными.Загрузка = Истина;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(НовЭлем, Истина);
	КонецЦикла;	
	
КонецПроцедуры

// Процедура определяет существующие элементы для синхронизации.
// 
Процедура ОпределитьСуществующиеЭлементыДляСинхронизации(ИсходныеИД) Экспорт
	
	Для Каждого Элемент Из ИсходныеИД Цикл
		
		Если Элемент.ПолеСинхронизации = "CatalogObject.бит_ВидыРеквизитовДвижений" Тогда
			Отбор = Новый Структура("Наименование");
			Отбор.Наименование = Элемент.ЗначениеПоля1;
            Выборка = Справочники.бит_ВидыРеквизитовДвижений.Выбрать(,, Отбор);
			Элемент.СуществующийИД = Неопределено;
			Пока Выборка.Следующий() Цикл
				Если Выборка.ИмяРегистра = Элемент.ЗначениеПоля2 Тогда
					Элемент.СуществующийИД = Выборка.Ссылка.УникальныйИдентификатор();
					Продолжить;
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли Элемент.ПолеСинхронизации = "CatalogObject.бит_ОбъектыСистемы" Тогда
            Выборка = Справочники.бит_ОбъектыСистемы.ОбъектСистемыПоПолномуИмени(Элемент.ЗначениеПоля1);
			Элемент.СуществующийИД = Неопределено;
			Если Не Выборка.Пустая() Тогда
				Элемент.СуществующийИД = Выборка.УникальныйИдентификатор();
			КонецЕсли;
		ИначеЕсли Элемент.ПолеСинхронизации = "CatalogObject.бит_КомплектыДвижений" Тогда
			Выборка = Справочники.бит_КомплектыДвижений.НайтиПоРеквизиту("УникальныйИД", Элемент.ЗначениеПоля1);
			Элемент.СуществующийИД = Неопределено;
			Если Не Выборка.Пустая() Тогда
				Элемент.СуществующийИД = Выборка.УникальныйИдентификатор();
			КонецЕсли;
		ИначеЕсли Элемент.ПолеСинхронизации = "CatalogObject.бит_ШаблоныДвижений" Тогда
			Если Элемент.ЗначениеПоля2 Тогда
				Выборка = Справочники.бит_ШаблоныДвижений.НайтиПоНаименованию(Элемент.ЗначениеПоля1, Истина);
				Элемент.СуществующийИД = Неопределено;
				Если Не Выборка.Пустая() Тогда
					Элемент.СуществующийИД = Выборка.УникальныйИдентификатор();
				КонецЕсли;
			Иначе	
				Выборка = Справочники.бит_ШаблоныДвижений.НайтиПоРеквизиту("УникальныйИД", Элемент.ЗначениеПоля1);
				Элемент.СуществующийИД = Неопределено;
				Если Не Выборка.Пустая() Тогда
					Элемент.СуществующийИД = Выборка.УникальныйИдентификатор();
				КонецЕсли;
			КонецЕсли;
		Иначе
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура выполняет вывод сообщения в поле.
// 
Процедура СообщитьВПоле(ТекстовыйДокумент, ТекстСообщения, Статус = Неопределено)
	
	Если ТекстовыйДокумент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекстовыйДокумент = ТекстовыйДокумент + Символы.ПС + ТекстСообщения;
	
КонецПроцедуры

// Функция получает значение узла.
// 
Функция ПолучитьЗначениеУзла(ЧтениеXML, ИмяУзла)
	
	Пока ЧтениеXML.Имя <> ИмяУзла Цикл
		флЧтениеВыполнено = ЧтениеXML.Прочитать();
		Если НЕ флЧтениеВыполнено Тогда		
			Прервать;		
		КонецЕсли; 
	КонецЦикла;
	
	Если ЧтениеXML.Прочитать() Тогда
		Возврат ЧтениеXML.Значение;
	Иначе	
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Функция возвращает новое имя файла выгрузки.
// 
Функция ИсправитьФайлИмпорта(ФайлВыгрузки)
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ФайлВыгрузки);
	
	ИсходныеИД = Новый ТаблицаЗначений;
	ИсходныеИД.Колонки.Добавить("ПолеСинхронизации");
	ИсходныеИД.Колонки.Добавить("ЗначениеПоля1");
	ИсходныеИД.Колонки.Добавить("ЗначениеПоля2");
	ИсходныеИД.Колонки.Добавить("ИсходныйИД");
	ИсходныеИД.Колонки.Добавить("СуществующийИД");
	
	Пока ЧтениеXML.ЛокальноеИмя <> "Data" Цикл
		ЧтениеXML.Прочитать()
	КонецЦикла;
	
	Пока ЧтениеXML.Прочитать() Цикл
		
		Если ЧтениеXML.ТипУзла <> ТипУзлаXML.КонецЭлемента Тогда
		
			// Нас интересуют только определенные узлы.
			Если ЧтениеXML.ЛокальноеИмя = "CatalogObject.бит_ВидыРеквизитовДвижений" Тогда
				// Необходимо синхронизировать с существующими элементами по наименованию.
				НовЗапись = ИсходныеИД.Добавить();
				// Получим значение поля "Ref".
				НовЗапись.ПолеСинхронизации  =	ЧтениеXML.ЛокальноеИмя;
				Новзапись.ИсходныйИД 		 = 	ПолучитьЗначениеУзла(ЧтениеXML, "Ref");
				Новзапись.ЗначениеПоля1 	 = 	ПолучитьЗначениеУзла(ЧтениеXML, "Description");
				Новзапись.ЗначениеПоля2 	 = 	ПолучитьЗначениеУзла(ЧтениеXML, "ИмяРегистра");
			ИначеЕсли ЧтениеXML.ЛокальноеИмя = "CatalogObject.бит_ОбъектыСистемы" Тогда
				// Необходимо синхронизировать с существующими элементами по наименованию.
				НовЗапись = ИсходныеИД.Добавить();
				// Получим значение поля "Ref".
				НовЗапись.ПолеСинхронизации =	ЧтениеXML.ЛокальноеИмя;
				Новзапись.ИсходныйИД 		= 	ПолучитьЗначениеУзла(ЧтениеXML, "Ref");
				Если Не ПолучитьЗначениеУзла(ЧтениеXML, "IsFolder") Тогда
					Новзапись.ЗначениеПоля1 =  ПолучитьЗначениеУзла(ЧтениеXML, "ИмяОбъектаПолное");
				КонецЕсли;
			ИначеЕсли ЧтениеXML.ЛокальноеИмя = "CatalogObject.бит_КомплектыДвижений" Тогда
				// Необходимо синхронизировать с существующими элементами по наименованию.
				НовЗапись = ИсходныеИД.Добавить();
				// Получим значение поля "Ref".
				НовЗапись.ПолеСинхронизации  =	ЧтениеXML.ЛокальноеИмя;
				Новзапись.ИсходныйИД 		 = 	ПолучитьЗначениеУзла(ЧтениеXML, "Ref");
				Новзапись.ЗначениеПоля1 	 = 	ПолучитьЗначениеУзла(ЧтениеXML, "УникальныйИД");
			ИначеЕсли ЧтениеXML.ЛокальноеИмя = "CatalogObject.бит_ШаблоныДвижений" Тогда
				// Необходимо синхронизировать с существующими элементами по наименованию.
				НовЗапись = ИсходныеИД.Добавить();
				// Получим значение поля "Ref".
				НовЗапись.ПолеСинхронизации =	ЧтениеXML.ЛокальноеИмя;
				Новзапись.ИсходныйИД 		= 	ПолучитьЗначениеУзла(ЧтениеXML, "Ref");
				Новзапись.ЗначениеПоля2 	= 	ПолучитьЗначениеУзла(ЧтениеXML, "IsFolder");
				Новзапись.ЗначениеПоля1 	= 	ПолучитьЗначениеУзла(ЧтениеXML, ?(Новзапись.ЗначениеПоля2, "Description", "УникальныйИД"));
				
			Иначе
				ЧтениеXML.Пропустить();
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Необходимо найти существующие элементы для синхронизации.
	ОпределитьСуществующиеЭлементыДляСинхронизации(ИсходныеИД);
	
	// Получим текст XML-файла.
	Текст 		  = Новый ЧтениеТекста(ФайлВыгрузки);
	ИсходныйТекст = Текст.Прочитать();
	
	// Осуществим замену найденных GUID, если не нашли - не меняем.
	ИсходныеИД.Свернуть("ИсходныйИД, СуществующийИД");
	
	Для Каждого ЭлементЗамены Из ИсходныеИД Цикл
		Если ЭлементЗамены.СуществующийИД <> Неопределено Тогда
			Если ЭлементЗамены.СуществующийИД <> ЭлементЗамены.ИсходныйИД Тогда
				ИсходныйТекст = СтрЗаменить(ИсходныйТекст, ЭлементЗамены.ИсходныйИД, ЭлементЗамены.СуществующийИД);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Текст = ИсходныйТекст;
	
	// Запишем результат в дополнительный файл.
	НовоеИмяФайла =  ФайлВыгрузки + "_";
	ЗаписьНовыйФайл = Новый ЗаписьТекста(НовоеИмяФайла);
	ЗаписьНовыйФайл.Записать(Текст);
	ЗаписьНовыйФайл.Закрыть();
	
	Возврат НовоеИмяФайла;
	
КонецФункции

// Функция выполняет начальную запись файла выгрузки.
// 
Функция НачатьЗаписьФайлаЭкспорта(ФайлВыгрузки)
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ФайлВыгрузки, "UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	ЗаписьXML.ЗаписатьНачалоЭлемента("_1CV8DtUD", "http://www.1c.ru/V8/1CV8DtUD/");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("V8Exch", "http://www.1c.ru/V8/1CV8DtUD/");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsi", "http://www.w3.org/2001/XMLSchema-instance");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("v8",  "http://v8.1c.ru/data");
	
	Возврат ЗаписьXML;
	
КонецФункции

// Процедура записывает объекты доступа.
// 
Процедура ЗаписатьОбъектыДоступа(ЗаписьXML, ВидыОбъектовДоступа)
	
	// Выберем все объекты доступа заданных видов.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидыОбъектовДоступа", ВидыОбъектовДоступа);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_ОбъектыСистемы.Ссылка
	|ИЗ
	|	Справочник.бит_ОбъектыСистемы КАК бит_ОбъектыСистемы
	|ГДЕ
	|	бит_ОбъектыСистемы.ВидОбъекта В(&ВидыОбъектовДоступа)
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ОбъектыСистемы.Ссылка";
						  
	Результат = Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		ЗаписатьXML(ЗаписьXML, Результат.Ссылка.ПолучитьОбъект());
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
